In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv("./user-ct-test-collection-02.txt", sep="\t")

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3614506 entries, 0 to 3614505
Data columns (total 5 columns):
 #   Column     Dtype
---  ------     -----
 0   AnonID     int64
 1   Query      object
 2   QueryTime  object
 3   ItemRank   float64
 4   ClickURL   object
dtypes: float64(1), int64(1), object(3)
memory usage: 137.9+ MB

In [8]:
data.drop("ClickURL", 1, inplace=True)
data.drop("ItemRank", 1, inplace=True)
data.drop("AnonID", 1, inplace=True)
data.drop("Query", 1, inplace=True)

/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/4209687664.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data.drop("ClickURL", 1, inplace=True)
/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/4209687664.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data.drop("ItemRank", 1, inplace=True)
/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/4209687664.py:3: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data.drop("AnonID", 1, inplace=True)
/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/4209687664.py:4: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data.drop("Query", 1, inplace=True)

In [27]:
data['QueryTime'] = pd.to_datetime(data['QueryTime'],format='%Y-%m-%d %H')

In [18]:
data['dt2'] = data['QueryTime'].apply(lambda x: x.replace(minute=0, second=0))

In [20]:
data.describe()

/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/3175101911.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  data.describe()
/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/3175101911.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  data.describe()

                  QueryTime                  dt2
count               3614506              3614506
unique              2290548                 2184
top     2006-03-16 19:36:49  2006-03-13 20:00:00
freq                    273                 3955
first   2006-03-01 00:01:16  2006-03-01 00:00:00
last    2006-05-31 23:59:56  2006-05-31 23:00:00

In [33]:
data = data[(data['dt2'] >= "2006-05-01")]

In [34]:
data.head(10)

             QueryTime                 dt2
90 2006-05-02 00:26:12 2006-05-02 00:00:00
91 2006-05-05 01:37:39 2006-05-05 01:00:00
92 2006-05-05 01:37:39 2006-05-05 01:00:00
93 2006-05-05 01:37:39 2006-05-05 01:00:00
94 2006-05-05 01:41:22 2006-05-05 01:00:00
95 2006-05-05 01:41:22 2006-05-05 01:00:00
96 2006-05-05 09:49:06 2006-05-05 09:00:00
97 2006-05-05 09:49:06 2006-05-05 09:00:00
98 2006-05-08 20:02:48 2006-05-08 20:00:00
99 2006-05-08 20:13:19 2006-05-08 20:00:00

In [35]:
data.describe()

/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/3175101911.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  data.describe()
/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/3175101911.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  data.describe()

                  QueryTime                  dt2
count               1230096              1230096
unique               779460                  720
top     2006-05-12 14:14:15  2006-05-23 00:00:00
freq                     93                 3630
first   2006-05-01 01:00:01  2006-05-01 01:00:00
last    2006-05-31 23:59:56  2006-05-31 23:00:00

In [36]:
data.drop("QueryTime", 1, inplace=True)

/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/2354198343.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data.drop("QueryTime", 1, inplace=True)

In [37]:
data.head(10)

                   dt2
90 2006-05-02 00:00:00
91 2006-05-05 01:00:00
92 2006-05-05 01:00:00
93 2006-05-05 01:00:00
94 2006-05-05 01:00:00
95 2006-05-05 01:00:00
96 2006-05-05 09:00:00
97 2006-05-05 09:00:00
98 2006-05-08 20:00:00
99 2006-05-08 20:00:00

In [39]:
data["time"] = (data["dt2"].dt.day - 1) * 24 + data["dt2"].dt.hour

In [40]:
data.head(10)

                   dt2  time
90 2006-05-02 00:00:00    24
91 2006-05-05 01:00:00    97
92 2006-05-05 01:00:00    97
93 2006-05-05 01:00:00    97
94 2006-05-05 01:00:00    97
95 2006-05-05 01:00:00    97
96 2006-05-05 09:00:00   105
97 2006-05-05 09:00:00   105
98 2006-05-08 20:00:00   188
99 2006-05-08 20:00:00   188

In [41]:
data.describe()

               time
count  1.230096e+06
mean   3.830469e+02
std    2.157343e+02
min    1.000000e+00
25%    1.920000e+02
50%    3.750000e+02
75%    5.690000e+02
max    7.430000e+02

In [42]:
data.to_csv('data.txt', sep='\t')

In [43]:
data.drop("dt2", 1, inplace=True)

/var/folders/2d/nvrnjcx10jd4l0g7vg4t9xmm0000gn/T/ipykernel_27905/3806698962.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data.drop("dt2", 1, inplace=True)

In [45]:
data.to_csv('data.txt', sep='\t', header= None, index=False)